liupade40/Singlechip/STM32/10、MyGame_Snake/Hardware/Encoder.c
#include "stm32f10x.h" 
#include "Delay.h" // Device header
uint16_t Encoder_Count=0;

void Encoder_Init(){

  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
 	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8|GPIO_Pin_9;
 	GPIO_Init(GPIOB, &GPIO_InitStructure); 
	 
	GPIO_EXTILineConfig(GPIO_PortSourceGPIOB,GPIO_PinSource8);
	GPIO_EXTILineConfig(GPIO_PortSourceGPIOB,GPIO_PinSource9);
	EXTI_InitTypeDef EXTI_InitStructure;
	EXTI_InitStructure.EXTI_Line=EXTI_Line8|EXTI_Line9;
  EXTI_InitStructure.EXTI_LineCmd=ENABLE;
	EXTI_InitStructure.EXTI_Mode=EXTI_Mode_Interrupt;
	EXTI_InitStructure.EXTI_Trigger=EXTI_Trigger_Falling;
	EXTI_Init(&EXTI_InitStructure);
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel=EXTI9_5_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelCmd=ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority=1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority=1;
	NVIC_Init(&NVIC_InitStructure); 
 
}

uint16_t Encoder_Get(){
uint16_t temp=Encoder_Count;
	Encoder_Count=0;
return temp;
}

void EXTI9_5_IRQHandler (void){

	if(EXTI_GetITStatus(EXTI_Line8)==SET){
		 /*如果出现数据乱跳的现象，可再次判断引脚电平，以避免抖动*/
		if (GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_8) == 0)
		{
			if (GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_9) == 0)
			{
				Encoder_Count ++;
			}
		}
 
		EXTI_ClearITPendingBit(EXTI_Line8);
	}
	if(EXTI_GetITStatus(EXTI_Line9)==SET){
		 /*如果出现数据乱跳的现象，可再次判断引脚电平，以避免抖动*/
		if (GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_9) == 0)
		{
			if (GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_8) == 0)
			{
				Encoder_Count --;
			}
		}
 
		EXTI_ClearITPendingBit(EXTI_Line9);
	}
}
